#Область ПеременныеФормы

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КонвертироватьXML2XSPF(Команда)
	
	КонвертироватьXML2XSPFНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПлейлистXMLНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПлейлистXML = "";
	ПлейлистXSPF = "";
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "Playlist <kursy-po-1c.ru> (*.xml)|*.xml";	
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = "Выберите файл";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПлейлистXML__ПослеВыбораФайла", ЭтотОбъект);
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлейлистXML__ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныеФайлы = Неопределено Тогда 
		Возврат;	
	КонецЕсли;
	
	ПлейлистXML = ВыбранныеФайлы[0]; 
	
	ВыбранныйФайл = Новый Файл(ВыбранныеФайлы[0]);
	ВыбранныйФайл__ПолноеИмя = ВыбранныйФайл.ПолноеИмя;
	ВыбранныйФайл__Расширение = ВыбранныйФайл.Расширение;
	числоСимволов = СтрДлина(ВыбранныйФайл__ПолноеИмя) - СтрДлина(ВыбранныйФайл__Расширение);
	ПлейлистXSPF = Лев(ВыбранныйФайл__ПолноеИмя, числоСимволов) + ".xspf";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КонвертироватьXML2XSPFНаСервере()
	
	узел__FOLDER_NAME = "<folder name=""";
	узел__FILE_NAME = "<file name=""";
	
	//+ содержимоеXML
	ЧтениеТекста = Новый ЧтениеТекста(ПлейлистXML);
	содержимоеXML = ЧтениеТекста.Прочитать();
	ЧтениеТекста = Неопределено;	
	//- содержимоеXML
	
	содержимоеXSPF = "";
	
	числоСтрок = СтрЧислоСтрок(содержимоеXML);
	Для сч = 1 По числоСтрок Цикл
		
		стрXML = СокрЛП(СтрПолучитьСтроку(содержимоеXML, сч));
		Если СтрНачинаетсяС(ВРег(стрXML), ВРег(узел__FOLDER_NAME)) Тогда
			стрXML = Сред(стрXML, СтрДлина(узел__FOLDER_NAME) + 1);
			поз = СтрНайти(стрXML, """>");
			Если поз = 0 Тогда 
				ВызватьИсключение "Внимание! Ошибка формата.";
			КонецЕсли;
			стрXML = Лев(стрXML, поз - 1);
			содержимоеXSPF = содержимоеXSPF + СтрШаблон("%1%1<track><title>%2</title></track>%3"
				, Символы.Таб
				, стрXML
				, Символы.ПС
			);
		ИначеЕсли СтрНачинаетсяС(ВРег(стрXML), ВРег(узел__FILE_NAME)) Тогда
			стрXML = Сред(стрXML, СтрДлина(узел__FILE_NAME) + 1);
			//поз = СтрНайти(стрXML, "/>");
			поз = СтрНайти(стрXML, """", НаправлениеПоиска.СКонца);
			Если поз = 0 Тогда 
				ВызватьИсключение "Внимание! Ошибка формата.";
			КонецЕсли;
			стрXML = Лев(стрXML, поз - 1);
			поз = СтрНайти(стрXML, """ value=""");
			Если поз = 0 Тогда 
				ВызватьИсключение "Внимание! Ошибка формата.";
			КонецЕсли;
			стрXML = СтрЗаменить(стрXML, """ value=""", "</title><location>file:///");
			содержимоеXSPF = содержимоеXSPF + СтрШаблон("%1%1<track><title>%2</location></track>%3"
				, Символы.Таб
				, стрXML
				, Символы.ПС
			);
		КонецЕсли;
		
	КонецЦикла;

	МакетXSPF = СодержимоеМакета("МакетXSPF");
	МакетXSPF = СтрЗаменить(МакетXSPF, "%TITLE%", СодержимоеTITLE);
	МакетXSPF = СтрЗаменить(МакетXSPF, "%BODY%", содержимоеXSPF);
	содержимоеXSPF = МакетXSPF;
	
	//+ содержимоеXSPF
	ЗаписьТекста = Новый ЗаписьТекста(ПлейлистXSPF);
	ЗаписьТекста.ЗаписатьСтроку(содержимоеXSPF);
	ЗаписьТекста.Закрыть();
	ЗаписьТекста = Неопределено;
	//- содержимоеXSPF

	ПоказатьПредупреждение(, "Ок");
	
КонецПроцедуры

&НаСервере
Функция СодержимоеМакета(Знач ИмяМакета)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Результат = ОбработкаОбъект.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

	